Revit 2024 API
ScheduleDefinition.GetSortGroupFields Method
 Gets all sorting/grouping fields in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<ScheduleSortGroupField> GetSortGroupFields()
Visual Basic
Public Function GetSortGroupFields As IList(Of ScheduleSortGroupField)
Visual C++
public:
IList<ScheduleSortGroupField^>^ GetSortGroupFields()
Return Value
 A list of all sorting/grouping fields.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace